import os

os.system("")

# ==============================================================================
# БАЗОВЫЕ СТИЛИ И МОДИФИКАТОРЫ
# ==============================================================================
RESET: str = "\033[0m"         # Сбросить всё к дефолту
BOLD: str = "\033[1m"          # Жирный текст / Яркий цвет
DIM: str = "\033[2m"           # Поблекший текст (полупрозрачный)
UNDERLINE: str = "\033[4m"     # Подчеркнутый
BLINK: str = "\033[5m"         # Мигающий
REVERSE: str = "\033[7m"       # Инверсия
HIDDEN: str = "\033[8m"        # Скрытый текст

# ==============================================================================
# СТАНДАРТНАЯ ПАЛИТРА (16 ЦВЕТОВ)
# ==============================================================================
# Обычный текст
BLACK: str = "\033[30m"
RED: str = "\033[31m"
GREEN: str = "\033[32m"
YELLOW: str = "\033[33m"
BLUE: str = "\033[34m"
MAGENTA: str = "\033[35m"
CYAN: str = "\033[36m"
WHITE: str = "\033[37m"

# Яркий текст
LIGHT_BLACK: str = "\033[90m"  
LIGHT_RED: str = "\033[91m"
LIGHT_GREEN: str = "\033[92m"
LIGHT_YELLOW: str = "\033[93m"
LIGHT_BLUE: str = "\033[94m"
LIGHT_MAGENTA: str = "\033[95m"
LIGHT_CYAN: str = "\033[96m"
LIGHT_WHITE: str = "\033[97m" 

# Фоны
BG_BLACK: str = "\033[40m"
BG_RED: str = "\033[41m"
BG_GREEN: str = "\033[42m"
BG_YELLOW: str = "\033[43m"
BG_BLUE: str = "\033[44m"
BG_MAGENTA: str = "\033[45m"
BG_CYAN: str = "\033[46m"
BG_WHITE: str = "\033[47m"
# Светлые фоны
BG_LIGHT_BLACK: str = "\033[100m"
BG_LIGHT_RED: str = "\033[101m"
BG_LIGHT_GREEN: str = "\033[102m"
BG_LIGHT_YELLOW: str = "\033[103m"
BG_LIGHT_BLUE: str = "\033[104m"
BG_LIGHT_MAGENTA: str = "\033[105m"
BG_LIGHT_CYAN: str = "\033[106m"
BG_LIGHT_WHITE: str = "\033[107m"

# ==============================================================================
# ДИНАМИЧЕСКИЕ ЦВЕTA
# ==============================================================================
def color_256(code: int) -> str:
    """
    Возвращает цвет текста из расширенной палитры 256 цветов (0-255).
    Полезные коды: 208 (Оранжевый), 112 (Салатовый), 141 (Фиолетовый)
    """
    if 0 <= code <= 255:
        return f"\033[38;5;{code}m"
    return RESET

def bg_256(code: int) -> str:
    """Возвращает цвет фона из расширенной палитры 256 цветов (0-255)."""
    if 0 <= code <= 255:
        return f"\033[48;5;{code}m"
    return RESET

def color_rgb(r: int, g: int, b: int) -> str:
    """
    Возвращает любой цвет текста по классическому RGB (True Color).
    Пример: color_rgb(255, 165, 0) -> Оранжевый
    """
    return f"\033[38;2;{r};{g};{b}m"

def bg_rgb(r: int, g: int, b: int) -> str:
    """Возвращает любой цвет фона по классическому RGB."""
    return f"\033[48;2;{r};{g};{b}m"
